//                  lecture tips lesson 5 (стрілочні функції, рекурсії, колбеки)

//  Звичайна функція, якій надано змінну

let foo = function () {
    console.log('foobar')
}

// Стрілочний варіант цієї ж функції

let foobar = () => console.log('foobar')

// Якщо в стрілочній функції кілька дій, її потрібно брати в фігурні дужки

let foobar2 = () => {
    console.log('foo');
    console.log('foooo')
}

//  Якщо функція, наприклад, буде приймати 2 аргументи і виводити їх суму

let calc = (a,b) => {return a + b};

console.log(calc(3,4))

// В такому випадку можна обійтись без написання return, так як якщо немає додаткових дій, функція сама зрозуміє що треба їх повернути

let calc2 = (a,b) => a + b;

console.log(calc2(5,8))





