// - Користувач вводить або має два числа. Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.

 let firstNumber = +prompt('Введіть перше число');
 let secondNumber = +prompt('Введіть друге число');

 if (firstNumber > secondNumber) {
     console.log(firstNumber)
         } else if (secondNumber > firstNumber) {
     console.log(secondNumber)
         } else if (firstNumber === secondNumber) {
     console.log('Введені числа - рівні')
         } else {
     console.log('Error: перевірте правильність введеної інформації')
       }

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

 let flatNumber = prompt('Щоб визначити під`їзд, кажіть номер вашої квартири')

 if (flatNumber > 1 && flatNumber <= 20) {
     console.log('Ваша квартира знаходиться в першому під`їзді')
 } else if (flatNumber <= 48) {
     console.log('Ваша квартира знаходиться в другому під`їзді')
 } else if (flatNumber <= 90) {
     console.log('Ваша квартира знаходиться в третьому під`їзді')
 }

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО,
// якщо змінна не рівна 10 - тоді НЕВІРНО

 let number = +prompt('Введіть числове значення');

 if (number === 10) {
     console.log('Вірно')
 } else if (number != 10) {
     console.log('Невірно')
 }

//- Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 4.
// якщо в змінну записали щось інше, спрацьовує else

 let x = [];

 if (typeof x === 'number') {
     console.log(1)
 } else if (typeof x === 'string') {
     console.log(2)
 } else if (typeof x === 'boolean') {
     console.log(3)
 } else if (typeof x === 'object') {
     console.log(4)
 }

//- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//  Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//  Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

 let gameTask = +prompt('Чи йдемо ми сьгодні в OKTEN на навчання? Вкажіть температуру повітря');

 if (gameTask >= 10 && gameTask <= 22) {
     console.log('Ми йдемо ВЧИТИСЯ')
 } else {
     console.log('Cидимо вдома і вчимося ОНЛАЙН')
 }

//  - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

 let prise = prompt('Введіть число від 1 до 5');

 switch (prise) {
         case '1':
         console.log('Ваш приз - автомобіль')
                 break;
     case '2':
         console.log('Ваш приз - мотоцикл')
                 break;
     case '3':
         console.log('Ваш приз - телефон')
                 break;
     case '4':
         console.log('Ваш приз - холодильник')
                 break;
     case '5':
         console.log('Ваш приз - перфоратор')
                 break;
     default:
         console.log('Введено невірне число')
         }

//                                          Additional

//- Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
//  кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//  Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

 let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];

 if (friends.length >= 3) {
     console.log('Це великий масив, в якому 3 і більше елементів')
 } else {
     console.log('Це маленький масив, в якому менше 3-х елементів')
 }

//- Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//  Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

 let a = 11;
 let b = 15;
 let c = 12;

 if (a > b && a < c) {
     console.log('A is middle', a)
 } else if (b > a && b < c) {
     console.log('b is middle', b)
 } else if (c > a && c < b) {
     console.log('c is middle', c)
 }

//  - Перепишіть конструкцію if з використанням умовного оператора '?':
//  let result;
//  if (a + b < 4) {
//     result = 'Мало';
//  } else {
//     result = 'Багато';
//  }

let a = 2;
let b = 1;

let result = (a + b < 4) ? 'Мало' : 'Багато';
console.log(result);

//  - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

let anyNumber = 0;

anyNumber > 0
    ? console.log('позитивне число')
    : anyNumber === 0
        ? console.log(0)
        : console.log('негативне число');





